{
  "backend/main.mo": "Defines game rule types and preset rules for Skyjo, Mille Bornes, Nerts, and Flip 7 plus game session and player profile field types.",
  "feature_evidence.json": "Lists feature evidence entries linking Flip 7 toggle‑UI requirements to the affected frontend file.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files including hooks, screens, components, and scoring utilities.",
  "frontend/index.css": "Tailwind CSS base/theme variables and dark‑mode tokens for global styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global layout, and profile‑setup gating based on authentication.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal for first‑time user profile creation, saving the name through the backend actor.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout with header navigation, mobile menu, login button, and routed content area.",
  "frontend/src/components/scores/Flip7ScoreEntry.tsx": "UI for Flip 7 round scoring with selectable cards, manual input, optional x2 multiplier, and final score calculation per player.",
  "frontend/src/components/scores/MilleBornesScoreEntry.tsx": "Form for Mille Bornes scoring that tracks distance and bonuses, calculates totals, and submits per‑player scores.",
  "frontend/src/components/scores/NertsScoreEntry.tsx": "Nerts scoring input that computes each player’s score from center cards and tableau cards with validation.",
  "frontend/src/components/scores/RoundsTable.tsx": "Displays all rounds in a table and allows editing round scores via a dialog.",
  "frontend/src/components/scores/SkyjoScoreEntry.tsx": "Simple per‑player numeric score input for Skyjo rounds with validation before submission.",
  "frontend/src/gameTemplates.ts": "Defines game templates for Skyjo, Mille Bornes, Nerts, and Flip7 and provides factory functions to create and look up game types.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current authenticated user's profile using the actor and exposes loading/authentication state.",
  "frontend/src/hooks/useGameSessions.ts": "Provides queries and mutations for listing, retrieving, creating game sessions, and adding rounds via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity, login/logout methods, and status through context.",
  "frontend/src/hooks/usePlayerProfiles.ts": "Fetches, creates, and retrieves player profiles using actor-backed queries and mutations.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light/dark themes and styling.",
  "frontend/src/lib/scoring.ts": "Calculates player totals, rankings, and checks game end conditions based on scoring rules.",
  "frontend/src/lib/sessionTypes.ts": "Defines TypeScript interfaces for session players, rounds, and local game session structure.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/screens/GamePickerScreen.tsx": "Displays available game types and navigates to setup when a user selects a game.",
  "frontend/src/screens/HistoryScreen.tsx": "Shows authenticated users their sorted game history with navigation to individual sessions.",
  "frontend/src/screens/ProfilesScreen.tsx": "UI screen for viewing, creating, and listing player profiles, with authentication checks and profile creation form.",
  "frontend/src/screens/ScoreSheetScreen.tsx": "Loads a game session, manages rounds and scoring, and displays score entry components based on game type.",
  "frontend/src/screens/SessionSetupScreen.tsx": "Handles setup of a new game session, including selecting saved profiles or adding quick players and configuring game-specific options.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Project metadata describing feature requirements, known issues, and state for Flip 7 card toggle updates."
}