{
  "backend/main.mo": "Defines game rule types and initializes rule data for multiple games inside the main actor, including Skyjo, Mille Bornes, Nerts, Phase 10, and Flip7.",
  "backend/migration.mo": "Defines OldActor and NewActor types and structures needed for state migration, including full game session and profile schemas.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides human‑written summaries for key frontend files describing functionality and recent updates.",
  "frontend/deployment-logs/.gitignore": "Ignores all deployment log files while keeping the directory.",
  "frontend/DEPLOYMENT.md": "Documentation explaining prerequisites and steps for local deployment and debugging.",
  "frontend/index.css": "Tailwind CSS base/theme definitions with light and dark mode variables applied globally.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/scripts/rebuild-and-capture-logs.mjs": "Node script that automates rebuild and deployment while capturing logs to timestamped files.",
  "frontend/src/App.tsx": "Sets up the app's root layout, authentication checks, and TanStack Router routes for main screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with query cache clearing and error handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Displays a dialog for entering and saving a new user's profile name via actor mutation.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main layout with navigation, header behavior, mobile menu, and login button.",
  "frontend/src/components/rules/GameRulesDialog.tsx": "Shows a dialog presenting a game's rules, description, and win conditions based on a template.",
  "frontend/src/components/scores/EditRoundDialog.tsx": "Provides a dialog for editing a round's scores, choosing the appropriate score entry component per game type.",
  "frontend/src/components/scores/Flip7ScoreEntry.tsx": "Handles Flip7 scoring input including card selection, modifiers, multipliers, manual entry, and score calculation.",
  "frontend/src/components/scores/GenericGameScoreEntry.tsx": "Renders simple numeric score inputs for each player and submits validated scores for a generic game.",
  "frontend/src/components/scores/MilleBornesScoreEntry.tsx": "Form component for entering Mille Bornes round data, managing distance, bonuses, and flags per player, then calculating and submitting scores.",
  "frontend/src/components/scores/NertsScoreEntry.tsx": "Handles input of center and tableau card counts for each player, computes Nerts scores, validates input, and submits the round state.",
  "frontend/src/components/scores/Phase10ScoreEntry.tsx": "Manages Phase 10 per‑player score entry and phase completion flags, validating input and submitting the round’s score and completion state.",
  "frontend/src/components/scores/RoundsTable.tsx": "Displays a table of all rounds with per‑player scores and provides an edit button for each round.",
  "frontend/src/components/scores/SkyjoScoreEntry.tsx": "Simple score entry form for Skyjo that validates numeric scores and submits them along with the saved round state.",
  "frontend/src/components/scores/SpiritsOwlScoreEntry.tsx": "Tracks stone selections for each Spirits of the Wild player, calculates scores using owl scoring logic, and submits the full round state.",
  "frontend/src/gameTemplates.ts": "Defines game templates with metadata and provides a function stub for creating backend game types.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAutoHideHeaderOnScroll.ts": "Tracks scroll direction to show or hide the header after passing a scroll threshold.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile using the authenticated actor and provides authentication state flags.",
  "frontend/src/hooks/useGameSessions.ts": "Provides queries and mutations for fetching, creating, and updating game sessions and rounds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a provider and hooks for Internet Identity login, storage, and status management.",
  "frontend/src/hooks/usePlayerProfiles.ts": "Manages loading, creating, and fetching individual player profiles via the backend actor.",
  "frontend/src/hooks/useSpiritsOfTheWildAnimals.ts": "Fetches Spirits of the Wild animal data from the backend.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes with Apple‑like color palettes.",
  "frontend/src/lib/roundEntryStateStorage.ts": "Handles saving, loading, and clearing round entry state in sessionStorage with serialization helpers and legacy fallbacks.",
  "frontend/src/lib/scoring.ts": "Implements score aggregation, standings sorting by game type, and game-end detection based on target scores or phase progress.",
  "frontend/src/lib/sessionTypes.ts": "Defines shared TypeScript types for players, rounds, per‑game entry states, and local session structures.",
  "frontend/src/lib/spiritsOwlScoring.ts": "Computes Spirits Owl board score by counting completed pairs and applying a spirit-stone multiplier.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider before rendering App.",
  "frontend/src/screens/GamePickerScreen.tsx": "Displays a list of selectable game templates and navigates to the setup screen when a game is chosen.",
  "frontend/src/screens/HistoryScreen.tsx": "Shows authenticated users a sortable list of saved game sessions with navigation to individual game views.",
  "frontend/src/screens/ProfilesScreen.tsx": "Manages player profiles, allowing creation and listing of saved players for authenticated users.",
  "frontend/src/screens/ScoreSheetScreen.tsx": "Loads or initializes a session, handles round submission and editing, and displays score entry components per game type.",
  "frontend/src/screens/SessionSetupScreen.tsx": "React screen for configuring a new game session, handling player selection, quick players, game-specific settings, and selecting active Spirits of the Wild animals.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash fragments, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, animations, and plugin setup.",
  "project_state.json": "Project state metadata describing Spirits of the Wild features, backend requirements, and pending feature requests for animal catalog and setup UI."
}