{
  "backend/main.mo": "Defines game rule types and preset rule data for multiple card games, plus initial structures for game sessions and scoring.",
  "feature_evidence.json": "Maps features to affected files, components, and test IDs for traceability with high-confidence evidence entries.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend source files including hooks, screens, scoring logic, and components.",
  "frontend/deployment-logs/.gitignore": "Ignores all generated deployment log files while keeping the directory.",
  "frontend/DEPLOYMENT.md": "Provides instructions and prerequisites for running local builds and deployments with DFX and Node.",
  "frontend/index.css": "Tailwind CSS setup with custom light and dark theme variables and base styling rules.",
  "frontend/index.html": "Base HTML document mounting the frontend app and loading the main TypeScript entrypoint.",
  "frontend/scripts/rebuild-and-capture-logs.mjs": "Node script that runs full backend and frontend rebuild/deploy steps while capturing logs to timestamped files.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, root layout, and routing for all major app screens with profile setup handling.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache clearing and error handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for first‑time user profile creation that saves the profile via the backend actor and refreshes cached data.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component with navigation, responsive mobile menu, and auto-hiding header using router state and auth status.",
  "frontend/src/components/rules/GameRulesDialog.tsx": "Dialog showing a game's rules and win conditions based on a provided template.",
  "frontend/src/components/scores/EditRoundDialog.tsx": "Dialog for editing round scores, selecting the appropriate score entry component and handling confirmation before saving.",
  "frontend/src/components/scores/Flip7ScoreEntry.tsx": "Score entry UI for Flip7, tracking selected cards, modifiers, multipliers, manual scores, and computing final scores.",
  "frontend/src/components/scores/GenericGameScoreEntry.tsx": "Basic score entry form for generic games, validating numeric input and submitting player scores.",
  "frontend/src/components/scores/MilleBornesScoreEntry.tsx": "Score entry form for Mille Bornes, handling distance, bonuses, trip conditions, and computing total scores.",
  "frontend/src/components/scores/NertsScoreEntry.tsx": "Form component for entering Nerts round scores, handling center and tableau card inputs, validation, and computed scoring before submitting.",
  "frontend/src/components/scores/RoundsTable.tsx": "Displays a table of rounds with per‑player scores and provides an edit button for each round.",
  "frontend/src/components/scores/SkyjoScoreEntry.tsx": "Simple score entry form for Skyjo that tracks per‑player numeric inputs and submits validated scores.",
  "frontend/src/gameTemplates.ts": "Defines game templates and a factory to create typed GameType objects with rules, scoring, and metadata.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAutoHideHeaderOnScroll.ts": "Hook that tracks scroll direction to hide or show the header after passing a threshold.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile using the active actor and Internet Identity state.",
  "frontend/src/hooks/useGameSessions.ts": "Provides hooks to fetch sessions, fetch a specific session, and mutate rounds or create sessions via backend actor calls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/usePlayerProfiles.ts": "Provides React Query hooks to list, create, and fetch individual player profiles via an actor API.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes and applies global styles.",
  "frontend/src/lib/scoring.ts": "Implements score aggregation, standings calculation, and game-end logic for multiple game types.",
  "frontend/src/lib/sessionTypes.ts": "Declares TypeScript types for players, rounds, entry states, and sessions across all supported games.",
  "frontend/src/main.tsx": "Bootstraps the app with ReactDOM, React Query, Internet Identity provider, and global styles.",
  "frontend/src/screens/GamePickerScreen.tsx": "Displays available games and navigates to the setup screen when a game is selected.",
  "frontend/src/screens/HistoryScreen.tsx": "Shows saved game sessions with navigation, handling authentication and loading states.",
  "frontend/src/screens/ProfilesScreen.tsx": "Manages player profiles with creation, listing, and authentication handling UI.",
  "frontend/src/screens/ScoreSheetScreen.tsx": "Loads or initializes a session, displays standings, handles round entry/editing, and checks game completion.",
  "frontend/src/screens/SessionSetupScreen.tsx": "Screen for configuring a new game session, allowing profile-based or quick players and validating player counts before creating a session.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters with sessionStorage fallbacks.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project metadata describing current features, requirements, and pending Phase 10 scorecard functionality."
}