{
  "backend/main.mo": "Defines multiple card game rule types and initializes rulesets for Skyjo, Mille Bornes, Nerts, Flip 7, Phase 10, and Generic Game.",
  "feature_evidence.json": "Lists feature evidence entries mapping UI changes to affected files and components with test IDs and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files describing their responsibilities and behaviors.",
  "frontend/deployment-logs/.gitignore": "Ignores all log files in the deployment-logs directory while keeping the directory itself.",
  "frontend/DEPLOYMENT.md": "Explains prerequisites and steps for local deployment, including automated rebuild instructions.",
  "frontend/index.css": "Tailwind-based global styling defining color variables for light and dark themes along with base styles.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/scripts/rebuild-and-capture-logs.mjs": "Node script that automates build and deployment stages while capturing all logs to timestamped files.",
  "frontend/src/App.tsx": "Sets up TanStack Router with main routes and renders AppLayout plus conditional profile setup dialog.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with state handling and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users to enter their name and saving the profile via backend actor mutation.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main application layout with auto-hiding header, navigation, and mobile menu using navigation state and authentication.",
  "frontend/src/components/rules/GameRulesDialog.tsx": "Displays a modal dialog showing game rules and win conditions based on a provided game template.",
  "frontend/src/components/scores/EditRoundDialog.tsx": "Provides a dialog for editing round scores by rendering the appropriate score entry component per game type and managing reset state.",
  "frontend/src/components/scores/Flip7ScoreEntry.tsx": "Implements Flip7 score entry with card selection, modifiers, multipliers, manual scoring, and automatic score calculation.",
  "frontend/src/components/scores/GenericGameScoreEntry.tsx": "Renders simple numeric score inputs for each player and submits validated scores with stored entry state.",
  "frontend/src/components/scores/MilleBornesScoreEntry.tsx": "Handles Mille Bornes scoring with distance input, multiple bonus toggles, and score calculation based on game rules.",
  "frontend/src/components/scores/NertsScoreEntry.tsx": "Provides a form for entering Nerts center and tableau card counts per player, computes round scores, and submits validated results.",
  "frontend/src/components/scores/Phase10ScoreEntry.tsx": "Handles Phase 10 per-player score and phase completion input, validates entries, and submits round data with state tracking.",
  "frontend/src/components/scores/RoundsTable.tsx": "Displays past rounds in a table with player scores and supports editing a selected round.",
  "frontend/src/components/scores/SkyjoScoreEntry.tsx": "Collects numeric Skyjo scores for each player, validates them, and submits the round’s entry state.",
  "frontend/src/gameTemplates.ts": "Defines game templates and a factory function to create typed game configurations with rules, end conditions, and scoring methods.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAutoHideHeaderOnScroll.ts": "Provides a hook that hides or shows a header based on scroll direction and movement threshold.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user profile using the authenticated actor and reports authentication and loading state.",
  "frontend/src/hooks/useGameSessions.ts": "Provides React Query hooks for fetching, creating, and updating game sessions and rounds via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context and provider, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/usePlayerProfiles.ts": "Defines hooks to fetch all player profiles, create new profiles, and get individual profiles through the backend actor.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables for colors, borders, and global styles.",
  "frontend/src/lib/scoring.ts": "Contains logic for computing player standings and determining end-of-game conditions across multiple game types.",
  "frontend/src/lib/sessionTypes.ts": "Defines TypeScript structures for players, rounds, entry-state per game, and local session metadata.",
  "frontend/src/main.tsx": "Initializes the app by rendering React with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/GamePickerScreen.tsx": "Renders a grid of available games and navigates to the setup screen when a game is selected.",
  "frontend/src/screens/HistoryScreen.tsx": "Displays saved game sessions for authenticated users and allows navigating to view or continue a game.",
  "frontend/src/screens/ProfilesScreen.tsx": "UI screen for listing, creating, and managing player profiles with authentication checks and table display.",
  "frontend/src/screens/ScoreSheetScreen.tsx": "Loads and manages a game session, handles rounds and scoring logic, and renders score entry components per game type.",
  "frontend/src/screens/SessionSetupScreen.tsx": "Configures a new game session using saved profiles or quick players, including player selection and game-specific options.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and content paths.",
  "project_state.json": "Project metadata describing current UI update work and feature requests for Phase 10 round submission behavior."
}