{
  "backend/main.mo": "Defines game rule types, concrete rule objects for multiple games including Generic Game, and begins an actor with game session logic and migration integration.",
  "backend/migration.mo": "Contains type definitions and a migration function converting old game/session types to updated ones including Generic Game.",
  "feature_evidence.json": "Lists feature evidence records mapping features to affected frontend files and components with associated test IDs.",
  "frontend-file-summaries.txt": "Provides short descriptions of all major frontend files, covering screens, components, hooks, and game template logic.",
  "frontend/deployment-logs/.gitignore": "Ensures deployment log files are ignored while keeping the directory.",
  "frontend/DEPLOYMENT.md": "Documentation describing prerequisites and steps to perform local deployment and collect debugging information.",
  "frontend/index.css": "Global Tailwind CSS file defining color variables, themes, and base styles for the app.",
  "frontend/index.html": "Base HTML file loading the React root element and main entry script.",
  "frontend/scripts/rebuild-and-capture-logs.mjs": "Node script that automates rebuild and deployment steps while capturing logs to timestamped files.",
  "frontend/src/App.tsx": "Sets up the root React Router structure, renders layout, and shows a profile setup dialog when needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with handling for authentication states and errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Displays a dialog to collect and save a user's display name via a mutation.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with navigation, header, footer, mobile menu, and outlet for routed content.",
  "frontend/src/components/scores/EditRoundDialog.tsx": "Dialog for editing a game round, selecting the correct score entry component based on game type and handling confirmation.",
  "frontend/src/components/scores/Flip7ScoreEntry.tsx": "Handles Flip7 round scoring with card selection, modifiers, multipliers, manual input, and score calculation.",
  "frontend/src/components/scores/GenericGameScoreEntry.tsx": "Collects numeric scores for all players in a generic game and submits them with simple validation.",
  "frontend/src/components/scores/MilleBornesScoreEntry.tsx": "React component for entering Mille Bornes scoring details per player, handling distance, bonuses, and boolean achievements, then computing and submitting final scores.",
  "frontend/src/components/scores/NertsScoreEntry.tsx": "React component that collects Nerts center and tableau card counts per player, computes round scores, validates input, and submits results.",
  "frontend/src/components/scores/RoundsTable.tsx": "Displays a table of past rounds with each player's score and provides an edit button for each round.",
  "frontend/src/components/scores/SkyjoScoreEntry.tsx": "Simple score entry form for Skyjo that captures numeric scores per player, validates them, and submits round data.",
  "frontend/src/gameTemplates.ts": "Defines built‑in game templates and a factory function that converts template IDs into backend GameType objects.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using the user’s identity, reinitializing and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the authenticated user’s profile using the actor and exposes loading and authentication state.",
  "frontend/src/hooks/useGameSessions.ts": "Hooks for listing, retrieving, creating, and updating game sessions through backend actor calls with React Query caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth, including login, logout, and loading stored identities.",
  "frontend/src/hooks/usePlayerProfiles.ts": "React Query hooks for fetching, creating, and retrieving individual player profiles via an actor API.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables defining theme colors for light and dark modes.",
  "frontend/src/lib/scoring.ts": "Utility functions to compute player standings and determine game end conditions based on scores and game type.",
  "frontend/src/lib/sessionTypes.ts": "Type definitions for session players, rounds, entry states, and session metadata used across scoring and UI.",
  "frontend/src/main.tsx": "App entry point that renders the root component within React Query and Internet Identity providers.",
  "frontend/src/screens/GamePickerScreen.tsx": "Displays available game templates and lets users navigate to game setup by selecting one.",
  "frontend/src/screens/HistoryScreen.tsx": "Shows authenticated users a list of saved game sessions with options to view or continue them.",
  "frontend/src/screens/ProfilesScreen.tsx": "Allows authenticated users to create and manage player profiles, displaying them in a table.",
  "frontend/src/screens/ScoreSheetScreen.tsx": "Loads a game session (saved or quick), renders the score sheet UI, and manages adding and editing rounds based on the selected game template.",
  "frontend/src/screens/SessionSetupScreen.tsx": "Handles player selection and configuration for starting a new game session, supporting both profile-based and quick-play modes.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters and sessionStorage-backed values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and content paths.",
  "project_state.json": "Tracks project metadata, feature requirements, and progress related to adding a Generic Game scorecard template."
}