{
  "backend/main.mo": "Defines rule types and presets for multiple card games including Skyjo, Mille Bornes, Nerts, Phase 10, and Flip 7 within a Motoko actor.",
  "feature_evidence.json": "Lists feature evidence entries linking Phase 10 checkbox behaviors to specific frontend files with metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files including hooks, screens, components, and utilities.",
  "frontend/deployment-logs/.gitignore": "Configures Git to ignore all log files in the deployment-logs directory while retaining the directory itself.",
  "frontend/DEPLOYMENT.md": "Documentation outlining prerequisites and steps for local deployment of the project using DFX and Node.",
  "frontend/index.css": "Defines Tailwind base layers and extensive CSS variables for light and dark themes across the app.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/scripts/rebuild-and-capture-logs.mjs": "Node script that automates rebuild and deployment while capturing full logs into timestamped files.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, root layout, authentication checks, and navigation for all app screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing and error handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog for entering a user name and saves it via a mutation, then refreshes the current user profile query.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with a header, navigation, mobile menu, and routed content slot using TanStack Router.",
  "frontend/src/components/rules/GameRulesDialog.tsx": "Displays a dialog showing a game's rules and win conditions based on a provided template.",
  "frontend/src/components/scores/EditRoundDialog.tsx": "Wraps score‑entry components for different game types, manages reset state, sorting, and handles saving or canceling round edits.",
  "frontend/src/components/scores/Flip7ScoreEntry.tsx": "Captures Flip7 scoring with card selection, modifiers, multipliers, manual input, and computes per‑player scores.",
  "frontend/src/components/scores/GenericGameScoreEntry.tsx": "Provides a simple numeric score entry form for arbitrary games and validates all player inputs before submitting.",
  "frontend/src/components/scores/MilleBornesScoreEntry.tsx": "Handles detailed Mille Bornes scoring inputs such as distance, bonuses, and flags, computing each player's score accordingly.",
  "frontend/src/components/scores/NertsScoreEntry.tsx": "Form component for entering Nerts center/tableau card counts, computing scores, and submitting validated round data.",
  "frontend/src/components/scores/Phase10ScoreEntry.tsx": "Handles Phase 10 score and phase completion input per player with validation, checkbox rules, and submission state tracking.",
  "frontend/src/components/scores/RoundsTable.tsx": "Displays a table of rounds and player scores with an edit button for each round.",
  "frontend/src/components/scores/SkyjoScoreEntry.tsx": "Simple score entry form for Skyjo that validates numeric scores and submits round data.",
  "frontend/src/gameTemplates.ts": "Defines game templates and creates backend game type objects based on selected template.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useAutoHideHeaderOnScroll.ts": "Hook that hides or shows the header based on scroll direction and threshold.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile using the actor and exposes authentication/loading state.",
  "frontend/src/hooks/useGameSessions.ts": "React Query hooks for fetching, creating, and updating game sessions via the actor, with cache invalidation on mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider for authentication using AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/usePlayerProfiles.ts": "React Query hooks for retrieving and creating player profiles through the actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and global base styles.",
  "frontend/src/lib/scoring.ts": "Implements standings calculation and game-end detection logic for multiple game types.",
  "frontend/src/lib/sessionTypes.ts": "Defines TypeScript types for session players, rounds, game entry states, and local session configuration.",
  "frontend/src/main.tsx": "App entry that initializes React, QueryClient, and the Internet Identity provider.",
  "frontend/src/screens/GamePickerScreen.tsx": "UI screen listing selectable games and navigating to game setup.",
  "frontend/src/screens/HistoryScreen.tsx": "Displays a user's saved game sessions with sorting, authentication checks, and navigation to session details.",
  "frontend/src/screens/ProfilesScreen.tsx": "UI for viewing and creating player profiles, including authentication checks and a table of existing profiles.",
  "frontend/src/screens/ScoreSheetScreen.tsx": "Displays and manages scoring for a game session, handling round creation, editing, submission, and session state loading.",
  "frontend/src/screens/SessionSetupScreen.tsx": "Screen for configuring a new game session, selecting players or quick players, setting targets, and starting the session.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining themes, colors, breakpoints, animations, and plugin setup.",
  "project_state.json": "Metadata describing project state, features, and requirements for Phase 10 score submission behavior."
}