{
  "kind": "build_request",
  "title": "Fix Phase 10 phase-complete checkbox toggle and logging on score submission",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the Phase 10 score submission screen, allow the user to toggle the “phase complete” checkbox freely before submitting scores (checked and unchecked), with the default state unchecked for all players when starting a new round.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The Phase 10 score submission screen.",
          "The default state is unchecked. If checked, the player should have the ability to uncheck the box before submitting"
        ]
      },
      "acceptanceCriteria": [
        "When starting a new Phase 10 round entry, each player's phase-complete checkbox is unchecked by default.",
        "If a user checks a player's box and then unchecks it before pressing “Submit Score”, the checkbox returns to unchecked state (no UI lock-in).",
        "This behavior applies for the Phase 10 score submission flow rendered from ScoreSheetScreen."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Phase 10 phase-complete checkbox visually behaves like a standard checkbox: the checkmark is visible only when checked and not visible when unchecked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When the box is checked the check mark appears. When the box is unchecked the check mark is not visible."
        ]
      },
      "acceptanceCriteria": [
        "Toggling the checkbox to checked displays the check indicator.",
        "Toggling the checkbox to unchecked hides the check indicator.",
        "No custom styling causes the check indicator to remain visible when unchecked."
      ]
    },
    {
      "id": "REQ-3",
      "text": "During Phase 10 score submission, only record/log a phase completion for a player if their phase-complete checkbox is checked at the moment the round is submitted; if unchecked at submission time, do not apply phase progression for that player.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Unchecking the box should be the phase is not complete, do not log a phase complete.",
          "The box check is only logged as phase complete if the box is checked at the time of the scores being submitted."
        ]
      },
      "acceptanceCriteria": [
        "If a player’s checkbox is unchecked at submission time, the submitted payload and any derived updates do not treat that player as having completed a phase for that round.",
        "If a player’s checkbox is checked at submission time, the submitted payload and any derived updates treat that player as having completed a phase for that round.",
        "For saved sessions, the backend submission endpoint does not increment/update Phase 10 progress for any completion entries where completed=false.",
        "For quick sessions (local-only), the local phase10Progress update logic does not increment phase for any players whose completion flag is false."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn UI components are read-only and must be composed, not edited).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend changes (if needed) must remain within the single-actor architecture in backend/main.mo; only add backend/migration.mo if state schema changes are required."
  ],
  "nonGoals": [
    "Do not change Phase 10 sorting/standings logic.",
    "Do not add new gameplay rules beyond the phase-complete checkbox submission behavior.",
    "Do not redesign unrelated parts of the score sheet UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}