{
  "kind": "build_request",
  "title": "Phase 10 round submission: always-visible unchecked phase-complete checkbox aligned right of score input",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Phase 10 round submission UI (Phase10ScoreEntry) so the \"Phase complete\" checkbox is always visible next to each player's score entry, and it is unchecked by default when entering a new round score.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "The checkbox should be present from the start and not require tapping the phase.",
          "The check box should always be but unchecked when a player is entering a score"
        ]
      },
      "acceptanceCriteria": [
        "On the Phase 10 round submission screen, each player row shows a checkbox with the label text \"Phase complete\" without requiring an extra click/tap to reveal it.",
        "When adding a new round (no initialState provided), the checkbox renders unchecked for every player by default.",
        "When editing an existing round (initialState provided), the checkbox state reflects the saved value from initialState (i.e., previously checked stays checked).",
        "Checkbox disable rules remain consistent with current behavior (e.g., disabled when the current user does not own the player and/or while submitting)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Adjust the layout on the Phase 10 round submission screen so the \"Phase complete\" label/checkbox control is right-justified to the right side of the player's score entry box (in the same row as the score input).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Let’s move the phase complete text justified to the right of the player score entry box.",
          "I’m talking about the current text label next to the checkbox."
        ]
      },
      "acceptanceCriteria": [
        "For each player card in Phase10ScoreEntry, the score input and the phase-complete control appear on the same horizontal line.",
        "The phase-complete control (checkbox + \"Phase complete\" label) is visually aligned to the right side of the score entry area (right-justified), not below the input.",
        "The layout remains usable on narrow/mobile widths (no overlapping controls; wraps gracefully if needed)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep all Phase 10 progression behavior tied to round submission; this change is UI-only."
  ],
  "nonGoals": [
    "Do not change backend Motoko logic or Phase 10 progression rules.",
    "Do not add new authentication mechanisms or change Internet Identity behavior.",
    "Do not change scoring validation beyond what is necessary to support the checkbox visibility/layout change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}