{
  "kind": "build_request",
  "title": "Flip 7 card selectors: change card buttons to independent on/off toggles",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Flip 7 score entry UI so each per-player card selection control (the grid items for 1–12, +4, +10) behaves as an on/off toggle representing whether that player has that card, rather than a button that adds repeatedly to the tally.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Each card selection button should become a toggle signifying you either have that card or don’t."
        ]
      },
      "acceptanceCriteria": [
        "On the Flip 7 score entry card grid, clicking a card control toggles it between OFF and ON states for the current player.",
        "When a card is ON, clicking it again turns it OFF (no repeated accumulation is possible).",
        "The selected state is tracked per player (toggling a card for Player A does not change Player B’s state)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure toggling a card ON/OFF for a player does not affect any other card’s state for that same player (no mutual exclusivity); all card toggles are independent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "When it is turned on it doesn’t affect any other card."
        ]
      },
      "acceptanceCriteria": [
        "Turning one card toggle ON leaves all other card toggles unchanged (whether ON or OFF).",
        "Turning one card toggle OFF leaves all other card toggles unchanged."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Visually represent each card selector’s toggle state using a clear, standard on/off style (e.g., distinct “on” styling vs “off” styling) so users can tell at a glance which cards are selected.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "The UI should visually show the toggle state in a standard on/off style."
        ]
      },
      "acceptanceCriteria": [
        "Each card control has an obvious visual difference between OFF and ON states (e.g., filled/active vs outline/inactive, plus appropriate focus/hover states).",
        "The on/off styling is accessible (maintains readable contrast and does not rely on color alone; e.g., includes a pressed state, check indicator, or equivalent)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update Flip 7 tally and validation logic to reflect toggle selection: the “Button Tally” value must equal the sum of values of all toggles currently ON for that player; the “Clear” action must reset all card toggles to OFF for that player.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Each card selection button should become a toggle signifying you either have that card or don’t."
        ]
      },
      "acceptanceCriteria": [
        "For a given player, the displayed Button Tally equals the sum of currently selected card values (including +4 and +10 if selected).",
        "Toggling a card ON increases the tally by that card’s value; toggling it OFF decreases the tally by that card’s value.",
        "The per-player Clear button turns OFF all selected card toggles for that player and sets that player’s Button Tally to 0.",
        "The Add Round button enable/disable logic continues to work: a player is considered valid if they have a valid manual score OR at least one card toggle is ON (tally > 0).",
        "After Add Round submission, all per-player toggle states reset to OFF (along with existing manual score and x2 reset behavior)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only UI component sources must be composed, not edited).",
    "Backend behavior and data structures must remain unchanged; this is a Flip 7 frontend interaction change only."
  ],
  "nonGoals": [
    "Do not add new Flip 7 scoring rules beyond changing card selection from incremental buttons to toggles.",
    "Do not change the x2 multiplier behavior or the manual entry behavior aside from ensuring they continue to work with the new toggle-based tally."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}