{
  "kind": "build_request",
  "title": "Support shared first place when winners tie on score",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the game-end result model to support multiple winners (a tie) instead of only a single `winner`, and ensure the scoring utilities can return all tied players when applicable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "If there is a tie for Lois score then the players tie for first place"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/lib/scoring.ts` no longer limits game-end results to a single winner when a tie occurs.",
        "When the winning condition is met and multiple players share the winning score, the game-end result includes all tied players (not just the first one).",
        "No TypeScript errors in callers due to the updated result type."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the game-over UI on the score sheet to correctly display ties for first place: if multiple winners are returned, show all tied player names and indicate they are tied for first place with the winning score.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "If there is a tie for Lois score then the players tie for first place"
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/screens/ScoreSheetScreen.tsx`, when the game is ended and multiple winners exist, the UI renders messaging that indicates a tie for first place (in English).",
        "When exactly one winner exists, the UI continues to show the existing single-winner message.",
        "The standings list remains unchanged and continues to render all players and totals."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (read-only UI component sources).",
    "Keep changes within the existing React + TypeScript + React Query + Tailwind stack; no new backend services."
  ],
  "nonGoals": [
    "Implementing Phase 10 scoring, phase tracking, or end-of-game logic (only tie-handling behavior for winners is in scope for this request).",
    "Adding game history storage or persistence changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}