{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Phase 10 score entry: always-visible phase-complete checkbox and right-aligned layout",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the Phase complete checkbox always visible in Phase10ScoreEntry and default unchecked for new rounds while preserving edit-state and disable rules.",
      "acceptanceCriteria": [
        "On the Phase 10 round submission screen, each player row shows a checkbox with the label text \"Phase complete\" without requiring an extra click/tap to reveal it.",
        "When adding a new round (no initialState provided), the checkbox renders unchecked for every player by default.",
        "When editing an existing round (initialState provided), the checkbox state reflects the saved value from initialState (i.e., previously checked stays checked).",
        "Checkbox disable rules remain consistent with current behavior (e.g., disabled when the current user does not own the player and/or while submitting)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/scores/Phase10ScoreEntry.tsx",
          "operation": "modify",
          "description": "Remove the current \"reveal\" interaction (revealedCheckboxes + Phase complete button) and render the checkbox + \"Phase complete\" label for every player row unconditionally. Initialize phaseCompletions so that when initialState is absent it contains explicit false entries for all players (unchecked by default), and when initialState is present it is used but any missing players default to false. Keep existing disable rules tied to ownership and isSubmitting, and keep Phase 10 progression behavior tied to submission (UI-only change)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Right-justify the Phase complete checkbox/label in the same row as the score input in Phase10ScoreEntry with responsive behavior.",
      "acceptanceCriteria": [
        "For each player card in Phase10ScoreEntry, the score input and the phase-complete control appear on the same horizontal line.",
        "The phase-complete control (checkbox + \"Phase complete\" label) is visually aligned to the right side of the score entry area (right-justified), not below the input.",
        "The layout remains usable on narrow/mobile widths (no overlapping controls; wraps gracefully if needed)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/scores/Phase10ScoreEntry.tsx",
          "operation": "modify",
          "description": "Adjust the player row layout so the score Input and the phase-complete control share a single flex row: make the Input expand (e.g., flex-1 with a sensible min-width) and place the checkbox+label group in a right-justified container (e.g., ml-auto, no shrinking). Ensure the row can wrap on very narrow widths without overlapping while still keeping the control aligned to the right when space allows."
        }
      ]
    }
  ]
}