{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Spirits of the Wild character board selection (frontend wiring + scoring filtering)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Persist selected Spirits of the Wild character board IDs in quick-session state and wire saved-session selection via backend calls/returned session data when available.",
      "acceptanceCriteria": [
        "When starting a non-quick (saved) session, the selected character board IDs are sent to the backend and stored with the created game session.",
        "When loading a saved session, the stored active character board IDs are returned to the frontend as part of the session data.",
        "Existing saved sessions created before this change still load successfully (missing selection defaults to an empty selection or a sensible default for Owl)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/sessionTypes.ts",
          "operation": "modify",
          "description": "Extend LocalSession to carry Spirits of the Wild active character board IDs (e.g., activeSpiritsAnimalIds?: bigint[]), so quick sessions and loaded sessions can share the same selection source."
        },
        {
          "path": "frontend/src/screens/SessionSetupScreen.tsx",
          "operation": "modify",
          "description": "When starting a Spirits of the Wild game: include selected board IDs in quick session navigation state (so scoring can render only selected boards), and for saved sessions call the backend capability to persist active Spirits of the Wild animal IDs after session creation (then navigate). Keep behavior backward-compatible when selection is empty by applying a defined default (e.g., auto-select Owl)."
        },
        {
          "path": "frontend/src/screens/ScoreSheetScreen.tsx",
          "operation": "modify",
          "description": "When constructing localSession from a saved session, read the stored active character board IDs from the loaded session data if present (tolerate missing field for legacy sessions). Ensure localSession has a sensible default (e.g., Owl) when no selection is available."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a Spirits of the Wild “Character Board Selection” section on the setup screen populated from backend-fetched animals with checkbox selection and icon/name display.",
      "acceptanceCriteria": [
        "The setup screen displays a \"Character Board Selection\" section directly below the player selection UI.",
        "The animals/characters shown come from the backend API (not a hardcoded list).",
        "Each listed animal shows its icon and name and a checkbox reflecting selection state.",
        "Starting the game includes the selected board IDs in the created session (or quick session state for quick games)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSpiritsOfTheWildAnimals.ts",
          "operation": "create",
          "description": "Create a React Query hook that fetches Spirits of the Wild animals via the backend actor’s getSpiritsOfTheWildAnimals call and exposes loading/error states for the setup screen."
        },
        {
          "path": "frontend/src/screens/SessionSetupScreen.tsx",
          "operation": "modify",
          "description": "For the Spirits of the Wild template, render a \"Character Board Selection\" section directly below the existing player selection UI (in both profiles and quick tabs). Use the new useSpiritsOfTheWildAnimals hook to list backend-fetched animals and render each row with icon, name, and a Checkbox reflecting local selection state. Ensure selected IDs are used by the start-game logic. Do not hardcode the animal list."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Filter the Spirits of the Wild scoring UI so only selected character board score entry components render; show a clear prompt or apply a default when none selected.",
      "acceptanceCriteria": [
        "If only Owl is selected, only the Owl score entry UI is rendered (using the existing SpiritsOwlScoreEntry).",
        "If multiple boards are selected, only those selected boards render (and no UI is rendered for unselected boards).",
        "If no boards are selected, the UI clearly prompts the user to select at least one board (or applies a defined default) rather than silently showing all boards.",
        "No unselected character board UI is visible anywhere on the score entry flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/ScoreSheetScreen.tsx",
          "operation": "modify",
          "description": "Update Spirits of the Wild scoring rendering to consult localSession.activeSpiritsAnimalIds and render only the score entry components for selected boards. If none are selected, show a clear in-flow message prompting selection (or enforce the same default selection used at session creation). Ensure no unselected board UI is rendered during add-round flow."
        },
        {
          "path": "frontend/src/components/scores/EditRoundDialog.tsx",
          "operation": "modify",
          "description": "Add support for an optional active Spirits of the Wild selection passed in from the score sheet, and apply the same filtering rules to the edit-round score entry UI so unselected boards never appear during editing."
        }
      ]
    }
  ]
}