{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Support shared first place on tied winning scores",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update scoring result types and utilities to return all tied winners when a win condition is met.",
      "acceptanceCriteria": [
        "`frontend/src/lib/scoring.ts` no longer limits game-end results to a single winner when a tie occurs.",
        "When the winning condition is met and multiple players share the winning score, the game-end result includes all tied players (not just the first one).",
        "No TypeScript errors in callers due to the updated result type."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/scoring.ts",
          "operation": "modify",
          "description": "Refactor the game-end result model from a single optional winner to a plural winners collection (supporting ties), and update checkGameEnd to compute the winning score then include all players tied at that score when the game-end condition is satisfied (e.g., for Nerts and Flip7). Ensure the exported types and return shapes remain consistent so downstream callers can be updated without TypeScript errors."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the ScoreSheet game-over banner to display either a single winner or a tie for first with all tied names and the winning score.",
      "acceptanceCriteria": [
        "In `frontend/src/screens/ScoreSheetScreen.tsx`, when the game is ended and multiple winners exist, the UI renders messaging that indicates a tie for first place (in English).",
        "When exactly one winner exists, the UI continues to show the existing single-winner message.",
        "The standings list remains unchanged and continues to render all players and totals."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/ScoreSheetScreen.tsx",
          "operation": "modify",
          "description": "Update the game-over UI logic to consume the new plural winners result from checkGameEnd. When winners.length > 1, render English tie-for-first messaging that lists all tied player names and shows the shared winning score; when winners.length === 1, keep the existing single-winner phrasing. Do not change the standings rendering."
        }
      ]
    }
  ]
}