{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-14T01:12:57.251Z",
  "summary": "Frontend work was added for fetching Spirits of the Wild animals and selecting/filtering character boards in setup/scoring, but the diff summary does not provide sufficient evidence that the backend now stores a seeded animal catalog, exposes an authorized query API to retrieve it, or persists the selected active character boards in saved game sessions (and returns them on load).",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Add a backend-stored animal/character catalog for Spirits of the Wild with stable id, name, icon, seeded with Owl, and retrievable via a query call.",
      "reason": "Although backend/main.mo defines a SpiritsOfTheWildAnimal type, the diff summary does not show any initialized backend catalog containing Owl or any query call returning it. The only concrete retrieval shown is a frontend hook calling actor.getSpiritsOfTheWildAnimals(), but the backend implementation of that method and any seeded data is not present in the shown backend diff.",
      "evidence": [
        "backend/main.mo",
        "frontend/src/hooks/useSpiritsOfTheWildAnimals.ts"
      ]
    },
    {
      "id": "REQ-2",
      "requirement": "Expose backend query API(s) to fetch the full list of animals/characters (id, name, icon) with consistent authorization and usable via generated Candid types.",
      "reason": "The frontend calls actor.getSpiritsOfTheWildAnimals(), but the diff summary does not show a corresponding public query method in backend/main.mo, nor any evidence of applying the app’s existing authorization approach to that read API.",
      "evidence": [
        "frontend/src/hooks/useSpiritsOfTheWildAnimals.ts",
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-3",
      "requirement": "Persist selected active character board IDs in a saved Spirits of the Wild game session on create, return them when loading, and keep old sessions loading successfully with a sensible default/empty selection.",
      "reason": "The frontend appears to pass/consume activeSpiritsAnimalIds via local state/navigation state (e.g., ScoreSheetScreen extracts from location.state), but there is no evidence in the backend diff summary that game sessions store active character board IDs, include them in returned session data, or handle backward compatibility for existing sessions.",
      "evidence": [
        "frontend/src/lib/sessionTypes.ts",
        "frontend/src/screens/ScoreSheetScreen.tsx",
        "backend/main.mo",
        "backend/migration.mo"
      ]
    }
  ],
  "hallucinated_features": [],
  "confidence": 0.62,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/components/scores/EditRoundDialog.tsx",
    "frontend/src/hooks/useSpiritsOfTheWildAnimals.ts",
    "frontend/src/lib/sessionTypes.ts",
    "frontend/src/screens/ScoreSheetScreen.tsx",
    "frontend/src/screens/SessionSetupScreen.tsx",
    "project_state.json"
  ]
}